Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For example, it can be used to discover the position of picture buttons, icons, web page links, or game objects.
ja: 例えば、絵柄のボタンやアイコン、Webページのリンク、ゲームオブジェクトの位置などを発見するのに利用できます。

source: For example, it cannot remap a lowercase character to an uppercase one.
ja: たとえば、小文字を大文字にリマップすることはできない。

source: For example, it works in a broader variety of games, it has no known alt-tab issues, and it is capable of firing AutoHotkey's hook hotkeys (whereas AutoHotkey's remapping requires a workaround).
ja: 例えば、より幅広いゲームで動作し、alt-tabの問題がなく、AutoHotkeyのフックホットキーを使用することができます（AutoHotkeyのリマッピングには回避策が必要です）。

source: For example, mode 3 requires that a window's title exactly match ExcludeTitle for that window to be excluded.
ja: 例えば、モード3では、ウィンドウのタイトルがExcludeTitleと完全に一致するウィンドウを除外する必要があります。

source: For example, most English and Western European locales treat not only the letters A-Z as identical to their lowercase counterparts, but also non-ASCII letters like Ä and Ü as identical to theirs.
ja: 例えば、英語や西欧のロケールでは、A～Zの小文字だけでなく、ÄやÜなどの非ASCII文字も小文字と同じように扱われることがほとんどです。

source: For example, most English and Western European locales treat the letters A-Z and ANSI letters like Ä and Ü as identical to their lowercase counterparts.
ja: 例えば、ほとんどの英語と西ヨーロッパのロケールでは、A-Zの文字とÄやÜなどのANSI文字が小文字と同じように扱われます。

source: For example, naming each parameter in a function's parameter list with a leading "p" or "p_" makes their special nature easy to discern at a glance, especially when a function has several dozen local variables competing for your attention.
ja: 例えば、関数のパラメータリストの各パラメータに「p」や「p_」という先頭の名前を付けると、特に数十個のローカル変数が競合している関数では、その特殊性が一目瞭然になる。

source: For example, new hotkeys can be launched even while a message box is being displayed by the current hotkey.
ja: 例えば、現在のホットキーでメッセージボックスを表示している最中でも、新しいホットキーを起動させることができます。

source: For example, on some keyboard layouts `e produces è while `z produces `z.
ja: 例えば、あるキーボードレイアウトでは、`eは èを、`zは `zを出力します。

source: For example, one can pass the name of a key to GetKeyState to determine whether that key is being held down.
ja: 例えば、GetKeyStateにキーの名前を渡すと、そのキーが押さえられているかどうかを判断することができます。

source: For example, rather than checking if (A_GuiEvent = "I" && InStr(ErrorLevel, "F", true)) in a g-label, the script would register a handler for the ItemFocus event: MyLV.OnEvent("ItemFocus", MyFunction).
ja: 例えば、g-labelでif (A_GuiEvent = "I" && InStr(ErrorLevel, "F", true))をチェックするのではなく、ItemFocusイベントに対するハンドラを登録するスクリプトとなります：MyLV.OnEvent("ItemFocus", MyFunction)。

source: For example, rather than checking if (A_GuiEvent = "I" && InStr(ErrorLevel, "F", true)) in a g-label, the script would register a handler for the ItemFocus event:
ja: 例えば、g-labelでif (A_GuiEvent = "I" && InStr(ErrorLevel, "F", true))をチェックするのではなく、ItemFocusイベントに対するハンドラを登録するスクリプトとなります：

source: For example, shell32.dll exports ExtractIconExW, ExtractIconExA and ExtractIconEx with no suffix, with the last two being equivalent.
ja: 例えば、shell32.dllはExtractIconExW、ExtractIconExA、ExtractIconExをサフィックスなしでエクスポートし、最後の2つは同等です。

source: For example, specify #c for the Win+C hotkey.
ja: 例えば、Win+Cのホットキーには#cを指定します。

source: For example, specify {LControl}{RControl} rather than {Control}.
ja: 例えば、{Control}ではなく、{LControl}{RControl}を指定します。

source: For example, specifying -100 would call Function 100 ms from now then delete the timer as though SetTimer Function, 0 had been used.
ja: 例えば、-100を指定すると、SetTimerFunction, 0を使用した場合と同様に、今から100ms後にFunctionを呼び出し、タイマーを削除します。

source: For example, specifying 1 would allow the variable to hold up to one character in addition to its internal terminator.
ja: 例えば、1を指定すると、内部ターミネーターに加えて1文字まで保持することができる。

source: For example, specifying "w200 h-1" would make the image 200 pixels wide and cause its height to be set automatically.
ja: 例えば、"w200 h-1"を指定すると、画像の幅は200ピクセルになり、高さは自動的に設定されました。

source: For example, specifying r3 in Options will create a 3-line edit control with the following default properties:
ja: 例えば、Optionsで r3を指定すると、次のようなデフォルトのプロパティを持つ3行エディットコントロールが作成されます：

source: For example, specifying r3 in Options will create a 3-line edit control with the following default properties: a vertical scroll bar, word-wrapping enabled, and Enter captured as part of the input rather than triggering the window's default button.
ja: 例えば、Optionsで r3を指定すると、次のようなデフォルトのプロパティを持つ3行エディットコントロールが作成されます：垂直スクロールバー、ワードラッピングを有効にし、Enterはウィンドウのデフォルトボタンをトリガーするのではなく、入力の一部としてキャプチャされます。

source: For example, specifying -E0x200 would remove the generic extended style WS_EX_CLIENTEDGE to eliminate the control's default border.
ja: 例えば、-E0x200を指定すると、汎用拡張スタイルWS_EX_CLIENTEDGEを削除して、コントロールのデフォルトボーダーをなくすことができます。

source: For example, specifying vMyEdit would name the control "MyEdit".
ja: 例えば、vMyEditを指定すると、コントロールに「MyEdit」という名前が付けられます。

source: For example, specifying x0 y0 would position the control in the upper left corner of the window's client area, which is the area beneath the title bar and menu bar (if any).
ja: 例えば、x0 y0を指定すると、コントロールはウィンドウのクライアント領域（タイトルバーとメニューバーがある場合はその下の領域）の左上隅に配置されます。

source: For example, specifying {Enter}.{Esc} would cause either Enter, ., or Esc to terminate the Input.
ja: 例えば、{Enter}.{Esc}と指定すると、Enter、.、Escのいずれかが入力を終了させることになる。

source: For example, specifying *w200 *h-1 would make the image 200 pixels wide and cause its height to be set automatically.
ja: 例えば、*w200 *h-1を指定すると、画像の幅は200ピクセルになり、高さは自動的に設定されました。

source: For example, specifying Y+10 would position the control 10 pixels beneath the bottom of the previous control rather than using the standard padding distance.
ja: 例えば、Y+10を指定すると、標準的なパディング距離ではなく、前のコントロールの下10ピクセルに位置します。

source: For example, specifying norm italic would set the font to normal then to italic.
ja: 例えば、norm italicを指定すると、フォントはノーマルに設定された後、イタリックに設定されます。

source: For example, specifying y+10 would position the control 10 pixels beneath the bottom of the previous control rather than using the standard padding distance.
ja: 例えば、Y+10を指定すると、標準的なパディング距離ではなく、前のコントロールの下10ピクセルに位置します。

source: For example, text containing `r`n is already in the right format to be added to a Gui Edit control.
ja: 例えば、`r`nを含むテキストは、Gui Editコントロールに追加するのに適したフォーマットになっています。

source: For example, the #HotIf expression for a custom combination like a & b:: might be evaluated when the prefix key (a in this example) is pressed, to determine whether it should act as a custom modifier key.
ja: 例えば、a & b:: のようなカスタムの組み合わせの #HotIf 式は、プレフィックスキー（この例ではa）が押されたときに評価され、カスタム修飾キーとして機能するかどうかを判断することができます。

source: For example, the Run function can accept between one and four parameters.
ja: 例えば、Run関数は1つから4つのパラメータを受け取ることができます。

source: For example, the Send function sends keystrokes, but may return before the keystrokes reach their destination and cause their intended effect.
ja: 例えば、Send関数はキーストロークを送信しますが、キーストロークが目的地に到達して意図した効果を発揮する前に戻ってくることがあります。

source: For example, the & in IsSetRef(&MyVar) would cause MyVar to resolve to a local variable by default, if used within an assume-local function which lacks the declaration global MyVar.
ja: 例えば、IsSetRef(&MyVar)の&は、global MyVarの宣言がない想定ローカル関数内で使用すると、MyVarがデフォルトでローカル変数に解決されます。

source: For example, the ~RButton hotkey above is fired as soon as the button is pressed.
ja: 例えば、上記の~RButtonのホットキーは、ボタンが押されるとすぐに起動します。

source: For example, the DeleteFile function is exported from kernel32.dll as DeleteFileA and DeleteFileW.
ja: 例えば、DeleteFile関数は、DeleteFileAと DeleteFileWとしてkernel32.dllからエクスポートされます。

source: For example, the HWND of a GUI window may be passed to an OnMessage function, or can be retrieved via Gui.Hwnd, WinExist or some other method.
ja: 例えば、GUIウィンドウのHWNDはOnMessage関数に渡されたり、Gui.HwndやWinExistなどのメソッドで取得することができる。

source: For example, the ListView notification LVN_BEGINLABELEDIT (-175 or -105) prevents the user from editing the label if the callback returns TRUE (1).
ja: 例えば、ListViewの通知LVN_BEGINLABELEDIT（-175または-105）は、コールバックがTRUE（1）を返す場合、ユーザーがラベルを編集できないようにします。

source: For example, the REG_BINARY value of 01,a9,ff,77 will be read as the string 01A9FF77.
ja: 例えば、REG_BINARYの値01,a9,ff,77は、文字列01A9FF77として読み込まれることになります。

source: For example, the body of an if statement is executed only if a specific condition is met.
ja: 例えば、if文の本文は、特定の条件を満たした場合にのみ実行されます。

source: For example, the brace in If ({ is the start of an object literal.
ja: 例えば、If ({のブレースはオブジェクト・リテラルの開始である。

source: For example, the color purple is defined 0x800080 because it has an intensity of 0x80 (128) for its blue and red components but an intensity of 0x00 (0) for its green component.
ja: 例えば、紫は青と赤の強度が0x80（128）、緑の強度が0x00（0）であるため、0x800080と定義されています。

source: For example, the entire expression could be enclosed with (( ... )).
ja: 例えば、式全体を(( ... ))で囲むことができます。

source: For example, the expression (Var+=2) > 50 is true if the newly-increased value in Var is greater than 50.
ja: 例えば、(Var+=2) > 50という式は、Varの新しく増加した値が50より大きい場合に真となる。

source: For example, the expression GetKeyState("Shift", "P") and GetKeyState("Ctrl", "P") returns 1 only if both keys are being physically held down.
ja: 例えば、GetKeyState("Shift", "P") and GetKeyState("Ctrl", "P")という式は、両方のキーが物理的に押されている場合にのみ1を返します。

source: For example, the expression (x <= y) is true when x has lesser or equal value to y.
ja: 例えば、(x <= y)という式は、xがyより小さいか等しい場合にtrueとなる。

source: For example, the expression 1+1 evaluates to the number 2.
ja: 例えば、1+1という式は、数字2に評価されます。

source: For example, the first column will always be column 1 from the script's point of view, even if the user has physically moved it to the right of other columns.
ja: 例えば、ユーザーが物理的に他の列の右に移動させたとしても、スクリプトから見て最初の列は常に列1です。

source: For example, the following are both valid:
ja: 例えば、以下はどちらも有効です：

source: For example, the following are both valid: LV.ModifyCol(1, 50) and LV.ModifyCol(1, "50 Integer").
ja: 例えば、以下はどちらも有効です：LV.ModifyCol(1, 50)、LV.ModifyCol(1, "50 Integer")。

source: For example, the following are equivalent:
ja: 例えば、以下は同等である：

source: For example, the following call would convert the contents of MyVar to uppercase:
ja: 例えば、次のように呼び出すと、MyVarの中身を大文字に変換します：

source: For example, the following call would convert the contents of MyVar to uppercase: DllCall("CharUpper", "Str", MyVar).
ja: 例えば、次のように呼び出すと、MyVarの中身を大文字に変換します：DllCall("CharUpper", "Str", MyVar)。

source: For example, the following call would pass the contents of MyVar to MyFunction by address, but would also update MyVar to reflect any changes made to it by MyFunction:
ja: 例えば、次の呼び出しでは、MyVarの内容をアドレスでMyFunctionに渡しますが、MyFunctionによる変更を反映してMyVarも更新されます：

source: For example, the following call would pass the contents of MyVar to MyFunction by address, but would also update MyVar to reflect any changes made to it by MyFunction: DllCall("MyDll\MyFunction", "Int*", &MyVar).
ja: 例えば、次の呼び出しでは、MyVarの内容をアドレスでMyFunctionに渡しますが、MyFunctionによる変更を反映してMyVarも更新されます：DllCall("MyDll\MyFunction", "Int*", &MyVar)。

source: For example, the following can be used to create a variable which a VBScript function can write into:
ja: 例えば、以下のようにすれば、VBScriptの関数が書き込むことができる変数を作成することができます：

source: For example, the following code attempts to restart the current script as admin:
ja: 例えば、次のコードは、現在のスクリプトをadminとして再起動しようとするものです：

source: For example, the following hotkey does not use the keyboard hook, but as a side-effect it is triggered by pressing either Home or NumpadHome:
ja: 例えば、以下のホットキーはキーボードフックを使用しませんが、副作用として、HomeまたはNumpadHomeのいずれかを押すと起動します：

source: For example, the following hotkey would create an empty e-mail message and prepare it for a certain type recipient, allowing you to personalize it prior to sending:
ja: 例えば、以下のホットキーを押すと、空のEメールメッセージが作成され、特定のタイプの受信者用に準備され、送信前にパーソナライズすることができます：

source: For example, the following hotstring produces "<em></em>" and moves the caret 5 places to the left (so that it's between the tags):
ja: 例えば、次のホットストリングは「<em></em>」を生成し、キャレットを5箇所左に移動させます（タグの間に入るようにします）：

source: For example, the following is equivalent to the SayHello definition above, except that this one returns "OK":
ja: 例えば、以下は上記のSayHelloの定義と同等ですが、こちらは「OK」を返すことを除きます：

source: For example, the following line would produce an uppercase B when you type either "a" or "A" (as long as CapsLock is off):
ja: 例えば、次の行では、「a」または「A」を入力すると、大文字の「B」が表示される（CapsLockがオフの場合）：

source: For example, the following might be expected:
ja: 例えば、次のようなことが予想される：

source: For example, the following pair of hotkeys scrolls horizontally instead of vertically when you turn the wheel while holding down the left Ctrl:
ja: 例えば、以下のホットキーのペアは、左Ctrlを押しながらホイールを回すと、垂直方向ではなく水平方向にスクロールします：

source: For example, the following set of hotkeys can be used to move the active window by 10 pixels in each direction, by holding RCtrl and pressing the arrow keys:
ja: 例えば、RCtrlを押しながら矢印キーを押すことで、アクティブなウィンドウを各方向に10ピクセルずつ移動させることができるホットキーのセットは次のとおりです：

source: For example, the following template may be used to debug regular expressions:
ja: たとえば、次のテンプレートを使用して正規表現をデバッグできます：

source: For example, the following two functions would disable the remapping a::b.
ja: 例えば、以下の2つの関数はa::bのリマッピングを無効にする。

source: For example, the following two hotkeys allow you to alt-tab with your right hand:
ja: 例えば、以下の2つのホットキーで、右手でalt-tabすることができます：

source: For example, the following two lines would produce a lowercase "b" when you press either Shift+A or Ctrl+A:
ja: 例えば、次の2行は、Shift+AまたはCtrl+Aを押すと小文字の「b」が表示される：

source: For example, the following two lines, when temporarily inserted at carefully chosen positions, create "break points" in the script:
ja: たとえば、次の2行を注意深く選んだ位置に一時的に挿入すると、スクリプトに「ブレークポイント」ができる：

source: For example, the following would be valid if typed at a command prompt:
ja: 例えば、以下のようにコマンドプロンプトで入力した場合は有効です：

source: For example, the following would first move the cursor down and to the right by 5 pixels from its starting position, and then drag it from that position down and to the right by 10 pixels:
ja: 例えば、次のようにすると、まずカーソルを開始位置から下と右に5ピクセル移動させ、その位置から下と右に10ピクセルずつドラッグします：

source: For example, the following would first move the cursor down and to the right by 5 pixels from its starting position, and then drag it from that position down and to the right by 10 pixels: MouseClickDrag "Left", 5, 5, 10, 10, , "R".
ja: 例えば、次のようにすると、まずカーソルを開始位置から下と右に5ピクセル移動させ、その位置から下と右に10ピクセルずつドラッグします：MouseClickDrag "Left", 5, 5, 10, 10, , "R"。

source: For example, the following would produce a single literal comma at the end of string:
ja: 例えば、次のようにすると、文字列の末尾にリテラルコンマが1つ入ることになります：

source: For example, the following would produce a single literal comma at the end of string: string1,,,string2.
ja: 例えば、次のようにすると、文字列の末尾にリテラルコンマが1つ入ることになります：string1,,,string2。

source: For example, the following would produce two different results:
ja: たとえば、次のようにすると、2つの異なる結果が得られます。

source: For example, the following would produce two different results: ::btw::by the way and ::btw:: by the way.
ja: たとえば、次のようにすると、2つの異なる結果が得られます：::btw::by the way、::btw:: by the way。

source: For example, the hotkey n:: would activate whenever you press N and would prevent you from typing that character.
ja: 例えば、ホットキーn::は、Nを押すたびにアクティブになり、その文字を入力できないようにすることができます。

source: For example, the hotkey +s::Send "{Blind}abc" would send ABC rather than abc because the user is holding down Shift.
ja: 例えば、ホットキー+s::Send "{Blind}abc"は、ユーザーがShiftを押しているため、abc ではなく ABC を送信します。

source: For example, the hotkey ^+a:: might be overridden by InputHook, whereas the hotkey $^+a:: would take priority unless the InputHook suppressed Ctrl or Shift.
ja: 例えば、ホットキー^+a::はInputHookによって上書きされるかもしれませんが、InputHookがCtrlまたはShiftを抑制しない限り、ホットキー$^+a::は優先されます。

source: For example, the hotkey <#a::SendText Address usually must release the left Win prior to sending the contents of Address, and press the left Win back down afterward (so that other Win key combinations continue working).
ja: 例えば、ホットキー<#a::SendText Addressは、通常、Addressの内容を送信する前に左Winを離し、送信後に左Winを押し戻す必要があります（他のWinキーの組み合わせが動作し続けるように）。

source: For example, the hotstring :*:ab`t:: would be triggered when you type "ab" followed by a tab.
ja: 例えば、ホットストリング:*:ab`t::は、「ab」の後にタブを入力したときにトリガーされるでしょう。

source: For example, the instance of #MaxThreadsBuffer that occurs closest to the bottom of the script will be used.
ja: 例えば、スクリプトの一番下にある#MaxThreadsBufferのインスタンスが使用されます。

source: For example, the launcher installed with AutoHotkey v2 uses it to determine which AutoHotkey executable to launch, while a script editor or related tools might use it to determine how to interpret or highlight the script file.
ja: 例えば、AutoHotkey v2と共にインストールされたランチャーは、どのAutoHotkey実行ファイルを起動するかを決定するために使用し、スクリプトエディターや関連ツールは、スクリプトファイルの解釈やハイライトの方法を決定するために使用するかもしれません。

source: For example, the left mouse button can trigger a hotkey action even while the click itself is being sent into the game normally (syntax:
ja: 例えば、マウスの左ボタンをクリックすると、クリックそのものが普通にゲームに送られていても、ホットキーアクションをトリガーすることができます（シンタックス：

source: For example, the left mouse button can trigger a hotkey action even while the click itself is being sent into the game normally (syntax: ~LButton::).
ja: 例えば、マウスの左ボタンをクリックすると、クリックそのものが普通にゲームに送られていても、ホットキーアクションをトリガーすることができます（シンタックス：~LButton::）。

source: For example, the location of the "Program Files" directory can vary between systems, and a script can take this into account by using the A_ProgramFiles variable.
ja: 例えば、「Program Files」ディレクトリの場所はシステムによって異なることがあり、スクリプトはA_ProgramFiles変数を使用することでこれを考慮することができます。

source: For example, the name of a key to send or a program to run, the number of times a hotkey has been pressed, the title of a window to activate, or whatever else has some meaning within the program or script.
ja: 例えば、送信するキーや実行するプログラムの名前、ホットキーが押された回数、起動するウィンドウのタイトルなど、プログラムやスクリプトの中で何らかの意味を持つものを指定します。

source: For example, the original first column is still number 1 even if the user drags it to the right of other columns.
ja: 例えば、ユーザーが他の列の右側にドラッグしても、元の1列目は1番のままです。

source: For example, the pattern im)abc would search for "abc" with the case-insensitive and multiline options (the parenthesis may be omitted when there are no options).
ja: 例えばim)abcというパターンは、大文字小文字を区別せず、複数行のオプションをつけて「abc」を検索する（オプションがない場合は括弧を省略できる）。

source: For example, the pattern m)^abc$ matches xyz`r`nabc.
ja: 例えば、パターンm)^abc$はxyz`r`nabcにマッチする。

source: For example, the pattern i)abc.*123 would turn on the case-insensitive option and search for "abc", followed by zero or more occurrences of any character, followed by "123".
ja: 例えば、i)abc.*123というパターンは、大文字小文字を区別しないオプションをオンにし、「abc」の後に任意の文字が0回以上出現し、その後に「123」が続くものを検索対象とします。

source: For example, the pattern i)abc searches for "abc" without regard to case.
ja: たとえば、i)abcというパターンは、大文字小文字を区別せずに「abc」を検索する。

source: For example, the pattern <.+> (which lacks a question mark) means:
ja: 例えば <.+>(クエスチョンマークがない）の意味：

source: For example, the pattern <.+> (which lacks a question mark) means: "search for a <, followed by one or more of any character, followed by a >".
ja: 例えば <.+>（クエスチョンマークがない）の意味：「<の後に任意の文字が1つ以上続き、その後に>が続くものを検索する」。

source: For example, the position of "abc" in "123abc789" is always 4.
ja: 例えば、「123abc789」の「abc」の位置は、常に4です。

source: For example, the presence of *a:: would cause ^a:: to always use the hook.
ja: 例えば、*a::があると、^a::は常にフックを使用するようになります。

source: For example, the red, green, and blue pixels can be encoded with different numbers of bits, or those bits can be located in different places in a pixel's color value.
ja: 例えば、赤、緑、青のピクセルを異なるビット数で符号化したり、それらのビットをピクセルの色値の異なる場所に配置したりすることができる。

source: For example, the regular expression abc matches abc123, 123abc, and 123abcxyz.
ja: 例えば、正規表現abcは、abc123、123abc、123abcxyzのどれにもマッチします。

source: For example, the remapping a::b would produce:
ja: 例えば、a::bの再マッピングでは、次のようになります：

source: For example, the remapping a::b would produce: 1) "b" when you type "a"; 2) uppercase "B" when you type uppercase "A"; and 3) Ctrl+B when you type Ctrl+A.
ja: 例えば、a::bの再マッピングでは、次のようになります：1)「a」と入力したときに「b」、2) 大文字の「A」と入力したときに「B」、3) Ctrl+Bと入力したときにCtrl+A。

source: For example, the result of "abc123" ~= "\d" is 4 (the position of the first numeric character).
ja: 例えば、"abc123" ~= "\d"の結果は4（最初の数字の位置）です。

source: For example, the statement if DirExist("C:\MyFolder") would be true if the folder exists and false otherwise.
ja: 例えば、if DirExist("C:\MyFolder")という文は、そのフォルダが存在すれば真、そうでなければ偽となります。

source: For example, the statement if FileExist("C:\My File.txt") would be true if the file exists and false otherwise.
ja: 例えば、if FileExist("C:\My File.txt")という文は、ファイルが存在すれば真、そうでなければ偽となります。

source: For example, the statement if (MyVar != "") would be true if MyVar is not blank.
ja: 例えば、if (MyVar != "")というステートメントは、MyVarが空白でなければ真となります。

source: For example, the statement if ItemCount would be false only if ItemCount is blank or 0.
ja: 例えば、ItemCountが空白か0の場合のみif ItemCount式は偽になります。

source: For example, the statement Var := Add(2, 3) would leave Var unchanged if Add() exits.
ja: 例えば、Var := Add(2, 3)という文は、Add()が終了してもVarは変更されないままです。

source: For example, the string "T33" would be considered greater than "T4".
ja: 例えば、文字列「T33」は「T4」よりも大きいと判断されるでしょう。

source: For example, the syntax for ControlSend is:
ja: 例えば、ControlSendの構文は以下の通りです：

source: For example, the value "Abc" would be represented as follows:
ja: 例えば、値「Abc」は次のように表現されます：

source: For example, there is no change in behaviour for ::1:::2 (1 → :2), but ::3::::4 is now 3 → ::4 rather than 3:: → 4.
ja: 例えば、::1:::2（1 → :2 ）では動作に変化はありませんが、::3::::4 は 3:: → 4 となるのではなく、 3→::4 となっています。

source: For example, this GUI shows a confirmation prompt before closing:
ja: 例えば、このGUIでは、閉じる前に確認のプロンプトが表示されます：

source: For example, this includes all supported options:
ja: 例えば、サポートされているすべてのオプションが含まれます：

source: For example, this includes all supported options: "x0 y0 w100 h100 T10.0 Password*".
ja: 例えば、サポートされているすべてのオプションが含まれます："x0 y0 w100 h100 T10.0 Password*"。

source: For example, this might be done when using a hidden GUI window to receive messages, or if the window is shown by "external" means such as WinShow (by this script or any other).
ja: 例えば、非表示のGUIウィンドウを使用してメッセージを受信する場合や、WinShowなどの「外部」手段でウィンドウを表示する場合（このスクリプトや他のスクリプトによる）などに行われることがあります。

source: For example, this minimizes the active window:
ja: 例えば、アクティブなウィンドウを最小化することができます：

source: For example, this retrieves the width and height of the virtual screen:
ja: 例えば、仮想スクリーンの幅と高さを取得することができます：

source: For example, this will wait at most 5 seconds for the window to appear:
ja: 例えば、この場合、ウィンドウが表示されるまで最大で5秒待ちます：

source: For example, tilting the wheel left or right on some mice sends a rapid flood of events which may reach the limit for hotkeys such as WheelLeft:: and WheelRight::.
ja: 例えば、一部のマウスでホイールを左右に傾けると、WheelLeft::やWheelRight::などのホットキーの限界に達するようなイベントが大量に送信されることがあります。

source: For example, to make the task bar transparent, use WinSetTransparent 150, "ahk_class Shell_TrayWnd".
ja: 例えば、タスクバーを透明にするには、WinSetTransparent 150, "ahk_class Shell_TrayWnd"を使います。

source: For example, to put both options into effect, the Flag parameter must be set to 3.
ja: 例えば、両方のオプションを有効にするには、Flagパラメータを3に設定する必要があります。

source: For example, to shutdown and power down the flag would be 9 (shutdown + power down = 1 + 8 = 9).
ja: 例えば、シャットダウンと電源オフの場合、フラグは9となります（シャットダウン＋電源おフ＝1＋8＝9）。

source: For example, to use 1 and 2, specify the number 3.
ja: 例えば、1と2を使う場合は、数字の3を指定します。

source: For example, use MyMenu.Delete("3&") if there are two items preceding the separator.
ja: 例えば、セパレータの前に2つの項目がある場合は、MyMenu.Delete("3&")を使用します。

source: For example, use <+s:: rather than LShift & s::.
ja: 例えば、LShift & s::ではなく、<+s:: を使用します。

source: For example, use the XP, XS, XM and X+M options for positioning controls and specify height in rows of text instead of pixels.
ja: 例えば、コントロールの位置指定にXP、XS、XM、X+Mオプションを使い、高さをピクセルではなくテキストの行数で指定します。

source: For example, use the xp, xs, xm and x+m options for positioning controls and specify height in rows of text instead of pixels.
ja: 例えば、コントロールの位置指定にxp、xs、xm、x+mオプションを使い、高さをピクセルではなくテキストの行数で指定します。

source: For example, using both F1::AltTabMenu and F1 up::OtherAction() is unsupported.
ja: 例えば、F1::AltTabMenuとF1 up::OtherAction()の両方を使用することはサポートされていません。
